CSI API ETABS v1
cSapModel Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cSapModel
Public Interface cSapModel
Dim instance As cSapModel
public interface class cSapModel
type cSapModel =  interface end
The cSapModel type exposes the following members.
Properties
Name | Description
Analyze
AreaElm
AreaObj
ConstraintDef
DatabaseTables
DesignCompositeBeam
DesignCompositeColumn
DesignConcrete
DesignConcreteSlab
DesignResults
DesignShearWall
DesignSteel
Detailing
Diaphragm
EditArea
EditFrame
EditGeneral
EditPoint
File
FrameObj
Func
GDispl
GridSys
GroupDef
LineElm
LinkElm
LinkObj
LoadCases
LoadPatterns
Options
PatternDef
PierLabel
PointElm
PointObj
PropArea
PropAreaSpring
PropFrame
PropLineSpring
PropLink
PropMaterial
PropPointSpring
PropRebar
PropTendon
RespCombo
Results
 Gives access to API calls related to analysis results.
SelectObj
SpandrelLabel
Story
TendonObj
Tower
View
Top
Methods
Name | Description
GetDatabaseUnits
 Returns a value from the eUnits enumeration indicating the database units for the model. All data is internally stored in the model in these units and converted to the present units as needed.
GetDatabaseUnits_2
 Retrieves the database units for the model. All data is internally stored in the model in these units and converted to the present units as needed.
GetMergeTol
GetModelFilename
 Returns a string that represents the filename of the current model, with or without the full path.
GetModelFilepath
 Returns the filepath of the current model
GetModelIsLocked
GetPresentCoordSystem
GetPresentUnits
 Returns a value from the eUnits enumeration indicating the units presently specified for the model.
GetPresentUnits_2
 Retrieves the present units for the model
GetProgramInfo
 Retrieve information about the program
GetProjectInfo
 Retrieves the project information data.
GetVersion
 Returns the program version.
InitializeNewModel
 This function clears the previous model and initializes the program for a new model. If it is later needed, you should save your previous model prior to calling this function.
SetMergeTol
SetModelIsLocked
 Locks or unlocks the model.
SetPresentUnits
 Sets the present units.
SetPresentUnits_2
 Sets the present units for the model
SetProjectInfo
 Sets the data for an item in the project information.
TreeIsUpdateSuspended
TreeResumeUpdateData
TreeSuspendUpdateData
Top
See Also
Reference
ETABSv1 Namespace